MORZE_DICT = {'A': '.-',     'B': '-...',   'C': '-.-.',
        'D': '-..',    'E': '.',      'F': '..-.',
        'G': '--.',    'H': '....',   'I': '..',
        'J': '.---',   'K': '-.-',    'L': '.-..',
        'M': '--',     'N': '-.',     'O': '---',
        'P': '.--.',   'Q': '--.-',   'R': '.-.',
        'S': '...',    'T': '-',      'U': '..-',
        'V': '...-',   'W': '.--',    'X': '-..-',
        'Y': '-.--',   'Z': '--..',

        '0': '-----',  '1': '.----',  '2': '..---',
        '3': '...--',  '4': '....-',  '5': '.....',
        '6': '-....',  '7': '--...',  '8': '---..',
        '9': '----.',  ',':'--..--',  '.':'.-.-.-',
        '?':'..--..',  '/':'-..-.',  '-':'-....-',
        '(':'-.--.',  ')':'-.--.-'}


# зашифровка морзе (разделяем символы пробелами, слова - двумя пробелами)
def zmorze(message):
   answer = ""
   for x in message:
      if x != " ":
         answer += MORZE_DICT[x] + " "
      else:
         answer += " "
      return answer

# расшифровка морзе (разделяем символы пробелами, слова - двумя пробелами)
def rmorze(message):
    message += " "
    answer = ""
    sym = ""
    i = 0
    for x in message:
        if (x != " "):
            i = 0
            sym += x
        else:
            i += 1
            if i == 2:
                answer += " "
            else:
                answer += list(MORZE_DICT.keys())[list(MORZE_DICT.values()).index(sym)]
                word = ""
    return answer

# зашифровка Цезаря
def zc(message, k):
  pass

# расшифровка Цезаря
def rc(message, k):
  pass
